app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "referred_by", "updated_at", "user_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 13 Jun 2012 17:28:57 UTC +00:00], ["email", "bob@bob.com"], ["name", "aaa"], ["referred_by", nil], ["updated_at", Wed, 13 Jun 2012 17:28:57 UTC +00:00], ["user_type", nil]]
---
  def create
    @user = User.new(params[:user])
    if @user.save